<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Extract the flat package from the macFUSE dmg.</string>
    <key>Identifier</key>
    <string>uk.co.guardian.pkg.GNM_macFUSE</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>macFUSE</string>
        </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>uk.co.guardian.download.macfuse</string>
    <key>Process</key>
    <array>
        <dict>
        <key>Comment</key>
        <string>Copy the pkg out of the DMG as it's flat and there's no need for the DMG</string>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/Extras/macFUSE*.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/GNM.%version%.autopkg.OS10.9plus.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
