<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of GraphicConverter 11 and creates a package.</string>
	<key>Identifier</key>
	<string>uk.co.guardian.pkg.GNM_Graphic_Converter_11</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GraphicConverter 11</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>uk.co.guardian.download.GraphicConverter11</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
			<key>app_path</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%/*.app</string>
			<key>pkg_path</key>
			<string>%RECIPE_CACHE_DIR%/GNM.%NAME%.%version%.autopkg.OS10.13plus.pkg</string>
		</dict>
		</dict>
		<dict>
		<key>Processor</key>
		<string>FileFinder</string>
		<key>Arguments</key>
		<dict>
			<key>pattern</key>
			<string>%RECIPE_CACHE_DIR%/*.pkg</string>
		</dict>
		</dict>
	</array>
</dict>
</plist>
