<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Tor Browser disk image and builds a package. The installer package includes a preinstall script that will check for an existing TorBrowser.app in /Applications and remove it if found. It will also create internetuser.default profile files for the localhome and home user folders. Use https://www.mozilla.org/en-US/firefox/102.0/system-requirements/#mac to confirm the requirements</string>
    <key>Identifier</key>
    <string>uk.co.guardian.pkg.GNM.TorBrowser</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TorBrowser</string>
        <key>LOCALE</key>
		<string>en-GB</string>
    </dict>
    <key>ParentRecipe</key>
    <string>uk.co.guardian.download.TorBrowserBundle</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/%app_name%</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/TorBrowser.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>GNM.%NAME%.%version%.autopkg.OS10.12plus</string>
                    <key>version</key>
                    <string>%version%</string>                
                    <key>id</key>
                    <string>uk.co.guardian.pkg.%NAME%.%version%.autopkg.os10.12plus</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>scripts</key>
                    <string>Scripts</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>